package ru.zharinov.introduced.hw;

/*
Создать новый класс, который будет выводить имена членов вашей семьи, каждое с новой строки.
Придумать классу соответствующее название
 */
public class FamilyMember {
    public static void main(String[] args) {
        System.out.println("Дедка");
        System.out.println("Бабка");
        System.out.println("Внучка");
        System.out.println("Жучка");
        System.out.println("Мурка");
    }
}
